# Panda

In [1]:
# Excel me apne data ko anaylysis krte h lekin problem is we cant access progamtically
# yes there is a VBA programming but its difficult than python programming
# Python 1--100 times than easier than VBA. we can read CVV, columns and take into data frame
# We know ram se data lena faster hota h hd se. so panda loads dataframe in ram
# Data frame isliye banate h taaki vo ram me aajaye aur badme use fastly access kra sake.

In [3]:
import numpy as np
import pandas as pd

In [7]:
df= pd.DataFrame()# D and F should be capital

In [9]:
print(df) # Empty dataframe se advantage agar aapko kahi se data uthake append krna h mtlb dynamically append krna h 
# hum blank data frame banate h

Empty DataFrame
Columns: []
Index: []

In [10]:
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[2,7,9,23],[23,23,63,12]])

In [11]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   2   7   9  23
3  23  23  63  12

In [13]:
df1.head()

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   2   7   9  23
3  23  23  63  12

In [14]:
df1.head(3)# tells top ke '3' you want to print

   0  1  2   3
0  1  2  3   4
1  5  6  7   8
2  2  7  9  23

In [15]:
df1.tail(2) # Tells neeche ke

    0   1   2   3
2   2   7   9  23
3  23  23  63  12